# AWS Well-Architected 프레임워크
애플리케이션 및 워크로드에 사용할 보안, 성능, 복원력 및 효율성이 뛰어난 인프라를 구축하는 클라우드 아키텍트를 돕기 위해 개발.\
클라우드에서 워크로드를 설계하고 실행하기 위한 주요 개념, 설계 원칙 및 아키텍처 모범 사례를 제공

* 보안
  * 정보와 시스템을 보호하는 데 중점
  * 데이터의 기밀성 및 무결성, 권한 관리를 통한 사용자 작업 식별 및 관리
  * 시스템 보호와 보안 이벤트 탐지를 위한 제어 설정
* 안정성
  * 워크로드가 의도하는 기능을 원하는 시점에 올바르고 일관적으로 수행하도록 하는 데 중점
  * 회복력 있는 워크로드는 장애에서 빠르게 회복되고 비즈니스와 고객의 요구사항을 충족
  * 분산 시스템 설계, 복구 계획, 변경 처리 방법 등을 제공
* 운영 우수성(탁월성)
  * 비즈니스 가치를 제공하고 지원 프로세스 및 절차의 지속적인 개선을 위해 시스템 실행 및 모니터링 기능을 포함
  * 클라우드에서 애플리케이션 코드에 사용한 동일한 엔지니어링 원칙을 전체 환경에 적용
  * 전체 워크로드(애플리케이션, 인프라)를 코드로 정의 및 업데이트 가능
  * 작업 철차 코드화와 이벤트 응답 트리거로 실행 자동화 구현
* 성능 효율성
  * IT 및 컴퓨팅 리소스를 효율적으로 사용하는 데 중점
  * 워크로드 요구 사항에 적한한 리소스 유형 및 크기 선택
  * 성능 모니터링과 정보에 입각한 의사결정을 통해 비즈니스 요구 사항의 변화에 맞춰 효율성을 유지하는 방법을 제공
* 비용 최적화
  * 불필요한 비용 발생을 피하는 데 중점
  * 지출 영역 파악 및 통제
  * 가장 적절하고 적합한 수의 리소스 유형 선택
  * 시간대별 지출 분석과 초과 지출 없이 비즈니스 요구사항에 맞춘 조정
